In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [5]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

### 1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [6]:
df['FlightNumber'].fillna(0,inplace=True)

In [7]:
df['FlightNumber'] = df['FlightNumber'].apply(lambda x : x+10)

In [8]:
df['FlightNumber'].dtype

dtype('float64')

In [9]:
df['FlightNumber'] = df['FlightNumber'].astype('int32')

In [10]:
df['FlightNumber'].dtype

dtype('int32')

### 2. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [11]:
df[['From','To']] = df['From_To'].str.split("_",expand=True)

In [12]:
df.head()

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10055,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10075,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10095,"[67, 32]","""Swiss Air""",Brussels,londOn

In [13]:
df.head()

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10055,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10075,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10095,"[67, 32]","""Swiss Air""",Brussels,londOn

### 3. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [14]:
df['To'] = df['To'].str.capitalize()

In [15]:
df.head()

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10055,"[23, 47]",KLM(!),LoNDon,Paris
1,MAdrid_miLAN,10,[],<Air France> (12),MAdrid,Milan
2,londON_StockhOlm,10075,"[24, 43, 87]",(British Airways. ),londON,Stockholm
3,Budapest_PaRis,10,[13],12. Air France,Budapest,Paris
4,Brussels_londOn,10095,"[67, 32]","""Swiss Air""",Brussels,London

### 4. Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [16]:
df.drop('From_To',axis=1,inplace=True)

In [17]:
df.head()

   FlightNumber  RecentDelays              Airline      From         To
0         10055      [23, 47]               KLM(!)    LoNDon      Paris
1            10            []    <Air France> (12)    MAdrid      Milan
2         10075  [24, 43, 87]  (British Airways. )    londON  Stockholm
3            10          [13]       12. Air France  Budapest      Paris
4         10095      [67, 32]          "Swiss Air"  Brussels     London

### 5. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.

In [18]:
df['LenRecentDelays']=df['RecentDelays'].apply( lambda x : len(x))

In [19]:
df.head()

,FlightNumber,RecentDelays,Airline,From,To,LenRecentDelays
0,10055,"[23, 47]",KLM(!),LoNDon,Paris,2
1,10,[],<Air France> (12),MAdrid,Milan,0
2,10075,"[24, 43, 87]",(British Airways. ),londON,Stockholm,3
3,10,[13],12. Air France,Budapest,Paris,1
4,10095,"[67, 32]","""Swiss Air""",Brussels,London,2

In [44]:
def new_column(data,colum):
    
    list_0=[]
    list_1=[]
    list_2=[]
    
    for items in data[colum]:
        #print(items)
        item_l = len(items)
        #print(len(items))
        for i in range(item_l):
            #print(items[i])
            if i== 0:
                list_0.append(items[i]) 
            if i== 1:
                list_1.append(items[i]) 
            if i== 2:
                list_2.append(items[i]) 

    
    new_df = pd.DataFrame([list_0,list_1,list_2])
    df_transpose= new_df.transpose()
    return df_transpose

In [46]:
new_df = new_column(df,'RecentDelays')

In [47]:
pd.concat([df,new_df],axis=1)

,FlightNumber,RecentDelays,Airline,From,To,LenRecentDelays,0,1,2
0,10055,"[23, 47]",KLM(!),LoNDon,Paris,2,23.0,47.0,87.0
1,10,[],<Air France> (12),MAdrid,Milan,0,24.0,43.0,NaN
2,10075,"[24, 43, 87]",(British Airways. ),londON,Stockholm,3,13.0,32.0,NaN
3,10,[13],12. Air France,Budapest,Paris,1,67.0,NaN,NaN
4,10095,"[67, 32]","""Swiss Air""",Brussels,London,2,NaN,NaN,NaN